# Pipe Fitting And Accessory Pressure Drop Item Properties

Source: https://www.revitapidocs.com/2026/22a1395a-ae80-8255-46b3-fc6ab1e90dbe.htm

---

| Pipe Fitting And Accessory Pressure Drop Item Properties |
| --- |

The PipeFittingAndAccessoryPressureDropItem type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | BeginConnectorIndex | The index of the begin connector of the flow path. |
|  | Coefficient | The coefficient between the begin connector and end connector, unitlesss. |
|  | EndConnectorIndex | The index of the end conector of the flow path. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | VelocityPressure | The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)). |

Top See Also

#### Reference

PipeFittingAndAccessoryPressureDropItem Class Autodesk.Revit.DB.Plumbing Namespace